
[
    {
        "id": "01",
        "filepath": "./symbols/symbol01.png",
        "name": "Bar",
        "description": "The classic Bar Chart uses either horizontal or vertical bars (column chart) to show discrete, numerical comparisons across categories. One axis of the chart shows the specific categories being compared and the other axis represents a discrete value scale.",
        "infoLink": "https://datavizcatalogue.com/methods/bar_chart.html"
    },
    {
        "id": "02",
        "filepath": "./symbols/symbol02.png",
        "name": "Histogram",
        "description": "A Histogram visualises the distribution of data over a continuous interval or certain time period. Each bar in a histogram represents the tabulated frequency at each interval/bin.",
        "infoLink": "https://datavizcatalogue.com/methods/histogram.html"
    },
    {
        "id": "03",
        "filepath": "./symbols/symbol03.png",
        "name": "Bullet",
        "description": "A bullet graph is a variation of a bar graph featuring a single, primary measure (for example, current year-to-date revenue) that compares that measure to one or more other measures to enrich its meaning (for example, compared to a target), and displays it in the context of qualitative ranges of performance, such as poor, satisfactory, and good.",
        "infoLink": "https://en.wikipedia.org/wiki/Bullet_graph"
    },
    {
        "id": "04",
        "filepath": "./symbols/symbol04.png",
        "name": "Line",
        "description": "Line Graphs are used to display quantitative values over a continuous interval or time period. A Line Graph is most frequently used to show trends and analyse how the data has changed over time.",
        "infoLink": "https://datavizcatalogue.com/methods/line_graph.html"
    },
    {
        "id": "05",
        "filepath": "./symbols/symbol05.png",
        "name": "Slope",
        "description": "The line chart’s fraternal twin. Line charts display three or more points in time while slope charts display exactly two points in time.",
        "infoLink": "http://datavizproject.com/data-type/slope-chart/"
    },
    {
        "id": "06",
        "filepath": "./symbols/symbol06.png",
        "name": "Gantt",
        "description": "A Gantt chart is a type of bar chart, that visualises various categories into time series. Gantt charts illustrate the start and finish time in time period blocks.",
        "infoLink": "http://datavizproject.com/data-type/gannt-chart/"
    },
    {
        "id": "07",
        "filepath": "./symbols/symbol07.png",
        "name": "Paired Bar",
        "description": "This variation of a Bar Chart is used when two or more data series are plotted side-by-side and grouped together under categories, all on the same axis.",
        "infoLink": "https://datavizcatalogue.com/methods/multiset_barchart.html"
    },
    {
        "id": "08",
        "filepath": "./symbols/symbol08.png",
        "name": "Waterfall",
        "description": "A waterfall chart helps in understanding the cumulative effect of sequentially introduced positive or negative values. Normally used for understanding how an initial value is affected by a series of intermediate positive or negative values.",
        "infoLink": "http://datavizproject.com/data-type/waterfall-chart/"
    },
    {
        "id": "09",
        "filepath": "./symbols/symbol09.png",
        "name": "Unit",
        "description": "Visual presentation of data using icons, pictures, symbols, etc., in place of or in addition to common graph elements (bars, lines, points). Pictographs use relative sizes or repetitions of the same icon, picture, or symbol to show comparison.",
        "infoLink": "http://datavizproject.com/data-type/pictorial-unit-chart/"
    },
    {
        "id": "10",
        "filepath": "./symbols/symbol10.png",
        "name": "Pie",
        "description": "A pie chart is divided into sectors, illustrating numerical proportion. In a pie chart, the arc length of each sector (and consequently its central angle and area), is proportional to the quantity it represents. While it is named for its resemblance to a pie which has been sliced, there are variations on the way it can be presented.",
        "infoLink": "http://datavizproject.com/data-type/pie-chart/"
    },
    {
        "id": "11",
        "filepath": "./symbols/symbol11.png",
        "name": "Dot Plot",
        "description": "A simple way of showing the change or range (min/max) of data across multiple categories.",
        "infoLink": "https://github.com/ft-interactive/chart-doctor/blob/master/visual-vocabulary/Visual-vocabulary.pdf"
    },
    {
        "id": "12",
        "filepath": "./symbols/symbol12.png",
        "name": "Heatmap",
        "description": "A heat map is a data visualization type where the individual values contained in a matrix through variations in coloring. The term “Heat map” was originally introduced by software designer Cormac Kinney in 1991 to describe a 2D display depicting real time financial market information even though similar visualizations have existed for over a century.",
        "infoLink": "http://datavizproject.com/data-type/heat-map/"
    },
    {
        "id": "13",
        "filepath": "./symbols/symbol13.png",
        "name": "Stacked Bar",
        "description": "Stacked Bar Chart is neither Multi-set Bar Chart nor simple Bar Chart. Stacked Bar Chart is multiple datasets on top of each other in order to show how the larger category is divided into the smaller categories and their relations to the total amount.",
        "infoLink": "http://datavizproject.com/data-type/stacked-bar-chart/"
    },
    {
        "id": "14",
        "filepath": "./symbols/symbol14.png",
        "name": "Pyramid",
        "description": "A pyramid chart is an inverted funnel chart. Similar to a funnel chart, the pyramid chart is a single series chart which does not use an axis. It represents data as portions of a 100% (the individual segments add up to represent a whole).",
        "infoLink": "http://datavizproject.com/data-type/pyramid-chart/"
    },
    {
        "id": "15",
        "filepath": "./symbols/symbol15.png",
        "name": "Scatterplot",
        "description": "Scatterplots use a collection of points placed using Cartesian Coordinates to display values from two variables. By displaying a variable in each axis, you can detect if a relationship or correlation between the two variables exists.",
        "infoLink": "https://datavizcatalogue.com/methods/scatterplot.html"
    },
    {
        "id": "16",
        "filepath": "./symbols/symbol16.png",
        "name": "Donut",
        "description": "A donut chart is functionally identical to a pie chart, with the exception of a blank center and the ability to support multiple statistics at once.",
        "infoLink": "http://datavizproject.com/data-type/donut-chart/"
    },
    {
        "id": "17",
        "filepath": "./symbols/symbol17.png",
        "name": "Sankey",
        "description": "Sankey Diagrams display flows and their quantities in proportion to one another. The width of the arrows or lines are used to show their magnitudes, so the bigger the arrow, the larger the quantity of flow. Flow arrows or lines can combine together or split through their paths on each stage of a process.",
        "infoLink": "https://datavizcatalogue.com/methods/sankey_diagram.html"
    },
    {
        "id": "18",
        "filepath": "./symbols/symbol18.png",
        "name": "Treemap",
        "description": "Treemaps display hierarchical (tree-structured) data as a set of nested rectangles. Each branch of the tree is given a rectangle, which is then tiled with smaller rectangles representing sub-branches. A leaf node’s rectangle has an area proportional to a specified dimension on the data. Often the leaf nodes are colored to show a separate dimension of the data.",
        "infoLink": "http://datavizproject.com/data-type/treemap/"
    },
    {
        "id": "19",
        "filepath": "./symbols/symbol19.png",
        "name": "Radar",
        "description": "A radar chart is a graphical method of displaying multivariate data in the form of a two-dimensional chart of three or more quantitative variables represented on axes starting from the same point. The relative position and angle of the axes is typically uninformative.",
        "infoLink": "http://datavizproject.com/data-type/radar-diagram/"
    },
    {
        "id": "20",
        "filepath": "./symbols/symbol20.png",
        "name": "Violin",
        "description": "A Violin Plot is used to visualise the distribution of the data and its probability density. This chart is a combination of a Box Plot and a Density Plot that is rotated and placed on each side, to show the distribution shape of the data. The thick black bar in the centre represents the interquartile range, the thin black line extended from it represents the 95% confidence intervals, and the white dot is the median.",
        "infoLink": "https://datavizcatalogue.com/methods/violin_plot.html"
    },
    {
        "id": "21",
        "filepath": "./symbols/symbol21.png",
        "name": "Venn",
        "description": "A Venn diagram uses overlapping circles or other shapes to illustrate the logical relationships between two or more sets of items. Often, they serve to graphically organize things, highlighting how the items are similar and different.",
        "infoLink": "https://www.lucidchart.com/pages/venn-diagram"
    },
    {
        "id": "22",
        "filepath": "./symbols/symbol22.png",
        "name": "Choropleth",
        "description": "Choropleth Maps display divided geographical areas or regions that are coloured, shaded or patterned in relation to a data variable. This provides a way to visualise values over a geographical area, which can show variation or patterns across the displayed location.",
        "infoLink": "https://datavizcatalogue.com/methods/choropleth.html"
    },
    {
        "id": "23",
        "filepath": "./symbols/symbol23.png",
        "name": "Chord",
        "description": "A chord diagram is a graphical method of displaying the inter-relationships between data in a matrix. The data is arranged radially around a circle with the relationships between the points typically drawn as arcs connecting the data together.",
        "infoLink": "http://datavizproject.com/data-type/chord-diagram/"
    },
    {
        "id": "24",
        "filepath": "./symbols/symbol24.png",
        "name": "Boxplot",
        "description": "A Box Plot is a convenient way of visually displaying the data distribution through their quartiles. The lines extending parallel from the boxes are known as the “whiskers”, which are used to indicate variability outside the upper and lower quartiles. Outliers can be plotted as individual dots that are in-line with whiskers.",
        "infoLink": "https://datavizcatalogue.com/methods/box_plot.html"
    },
    {
        "id": "25",
        "filepath": "./symbols/symbol25.png",
        "name": "Timeline",
        "description": "A Timeline displays a list of events in chronological order. Some timelines work on a scale, while others simply display events in sequence. The main purpose is to communicate time-related information, over time, either for analysis or to visually present a story or view of history.",
        "infoLink": "http://datavizproject.com/data-type/timeline/"
    },
    {
        "id": "26",
        "filepath": "./symbols/symbol26.png",
        "name": "Word Cloud",
        "description": "A tag cloud is a visual representation for text data, typically used to depict keyword metadata (tags) on websites, to visualize free form text or to analyses speeches. Tags are usually single words, and the importance of each tag is shown with font size or color.",
        "infoLink": "http://datavizproject.com/data-type/tag-cloud/"
    },
    {
        "id": "27",
        "filepath": "./symbols/symbol27.png",
        "name": "Waffle",
        "description": "A waffle chart shows progress towards a target or a completion percentage. There is a grid of small cells, of which coloured cells represent the data.",
        "infoLink": "http://datavizproject.com/data-type/percentage-grid/"
    },
    {
        "id": "28",
        "filepath": "./symbols/symbol28.png",
        "name": "Sunburst",
        "description": "A Sunburst Diagram is used to visualize hierarchical data, depicted by concentric circles. The circle in the centre represents the root node, with the hierarchy moving outward from the center. A segment of the inner circle bears a hierarchical relationship to those segments of the outer circle which lie within the angular sweep of the parent segment.",
        "infoLink": "http://datavizproject.com/data-type/sunburst-diagram/"
    },
    {
        "id": "29",
        "filepath": "./symbols/symbol29.png",
        "name": "Stacked Area",
        "description": "Stacked Area Chart is similar to the simple Area Chart, but here is uses multiple data series that start each point from the point left by the previous series. It is useful for comparing multiple variables changing over interval.",
        "infoLink": "http://datavizproject.com/data-type/stacked-area-chart/"
    },
    {
        "id": "30",
        "filepath": "./symbols/symbol30.png",
        "name": "Cartogram",
        "description": "Simply put, a cartogram is a map. But a cartogram is a unique type of map because it combines statistical information with geographic location. Physical or topographical maps show relative area, distance, and terrain, but they do not provide any data about the inhabitants of a place.",
        "infoLink": "https://populationeducation.org/what-cartogram/"
    },
    {
        "id": "31",
        "filepath": "./symbols/symbol31.png",
        "name": "Network",
        "description": " A network graph is a representation of a set of objects (nodes) where some pairs of objects are connected by links.",
        "infoLink": "https://www.infoq.com/articles/GraphX-Intro"
    }    
]